#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура();
	ПараметрыРегистрации.Вставить("Наименование", "Включение возможности работы регламентных заданий");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Версия", "1.0.0");
	ПараметрыРегистрации.Вставить("Информация", "Включение возможности работы регламентных заданий");
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	
	КомандыОбработки = Новый ТаблицаЗначений;
	КомандыОбработки.Колонки.Добавить("Идентификатор");
	КомандыОбработки.Колонки.Добавить("Использование");
	КомандыОбработки.Колонки.Добавить("Представление");
	СтрокаКоманды = КомандыОбработки.Добавить();
	СтрокаКоманды.Идентификатор = "ВключениеВозможностиРаботыРегламентныхЗаданий";
	СтрокаКоманды.Использование = "ОткрытиеФормы";
	СтрокаКоманды.Представление = "Включение возможности работы регламентных заданий";
	
	ПараметрыРегистрации.Вставить("Команды", КомандыОбработки);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти